In [1]:
from pandas import DataFrame
data={'Name':['Divya','Rohith','Rudra'],
      'Age':[30,35,3],
      'Salary':[100,300,50]}

In [2]:
frame=DataFrame(data)
frame

     Name  Age  Salary
0   Divya   30     100
1  Rohith   35     300
2   Rudra    3      50

In [3]:
new_frame=DataFrame(data,columns=['Name','Salary','Age'])
new_frame

     Name  Salary  Age
0   Divya     100   30
1  Rohith     300   35
2   Rudra      50    3

In [9]:
new_frame=DataFrame(data,columns=['Name','Salary','Age','IsActive'])
new_frame

     Name  Salary  Age IsActive
0   Divya     100   30      NaN
1  Rohith     300   35      NaN
2   Rudra      50    3      NaN

In [5]:
new_frame['Salary']

0    100
1    300
2     50
Name: Salary, dtype: int64

In [6]:
new_frame.ix[2]

AttributeError: 'DataFrame' object has no attribute 'ix'

In [7]:
new_frame.loc[2]

Name        Rudra
Salary         50
Age             3
IsActive      NaN
Name: 2, dtype: object

In [8]:
new_frame=DataFrame(data,columns=['Name','Salary','Age'])
new_frame

     Name  Salary  Age
0   Divya     100   30
1  Rohith     300   35
2   Rudra      50    3

In [10]:
new_frame=DataFrame(data,columns=['Name','Salary','Age','Profile'])
new_frame

     Name  Salary  Age Profile
0   Divya     100   30     NaN
1  Rohith     300   35     NaN
2   Rudra      50    3     NaN

In [11]:
new_frame['Profile']="Doctor"

In [12]:
new_frame

     Name  Salary  Age Profile
0   Divya     100   30  Doctor
1  Rohith     300   35  Doctor
2   Rudra      50    3  Doctor

In [13]:
new_frame['Education']="Masters"
new_frame

     Name  Salary  Age Profile Education
0   Divya     100   30  Doctor   Masters
1  Rohith     300   35  Doctor   Masters
2   Rudra      50    3  Doctor   Masters

In [14]:
new_frame.T

                 0        1        2
Name         Divya   Rohith    Rudra
Salary         100      300       50
Age             30       35        3
Profile     Doctor   Doctor   Doctor
Education  Masters  Masters  Masters

In [15]:
from pandas import Series
obj=Series([100,200,300,400,500],index=['a','b','c','d','e'])
obj

a    100
b    200
c    300
d    400
e    500
dtype: int64

In [16]:
obj=obj.reindex(['e','d','c','b','a'])
obj

e    500
d    400
c    300
b    200
a    100
dtype: int64

In [17]:
frame

     Name  Age  Salary
0   Divya   30     100
1  Rohith   35     300
2   Rudra    3      50

In [20]:
frame.reindex([0,2,1])

     Name  Age  Salary
0   Divya   30     100
2   Rudra    3      50
1  Rohith   35     300

In [24]:
ser=Series([3,7,1,4,7,2,5,6,2,4],index=[1,3,4,6,7,2,5,8,9,10])
ser

1     3
3     7
4     1
6     4
7     7
2     2
5     5
8     6
9     2
10    4
dtype: int64

In [25]:
ser.sort_index()

1     3
2     2
3     7
4     1
5     5
6     4
7     7
8     6
9     2
10    4
dtype: int64